---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryDirectionY
source: html/0548857d-7573-d232-0ff8-0c8ba70f13ab.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryDirectionY Property

"Y Translation"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryDirectionY { get; }
```